# Pandas

In [1]:
import pandas as pd
import numpy as np

# Create DataFrame

In [2]:
name = ['Vinayak', 'Sarva', 'Amit', 'Ravi']
intelligence = ['Smart', 'Laziness', 'Bakchodi', 'Ra===i']
qualification = ['B.E', 'BSC', 'BAF', 'B.E']
df = pd.DataFrame({'Name':name, 'Qualification':qualification, 'Intelligence': intelligence})
df

      Name Qualification Intelligence
0  Vinayak           B.E        Smart
1    Sarva           BSC     Laziness
2     Amit           BAF     Bakchodi
3     Ravi           B.E       Ra===i

# Another Way Creating Data Frame

In [3]:
age = np.random.randint(low = 18, high = 60, size = 10)
name = np.random.choice(['Vinayak', 'Sarvanan', 'Amit', 'Ravi'], size = 10)
default = np.random.choice([0, 1], size = 10)
mydata = list(zip(name, age, default))
mydata

[('Ravi', 32, 1),
 ('Sarvanan', 23, 1),
 ('Ravi', 19, 1),
 ('Sarvanan', 46, 1),
 ('Ravi', 56, 0),
 ('Amit', 32, 0),
 ('Sarvanan', 52, 0),
 ('Sarvanan', 34, 0),
 ('Ravi', 47, 1),
 ('Sarvanan', 35, 0)]

In [4]:
mydata1 = pd.DataFrame({"Age":age, "Name":name, "Owned Car":default})
mydata1

   Age      Name  Owned Car
0   32      Ravi          1
1   23  Sarvanan          1
2   19      Ravi          1
3   46  Sarvanan          1
4   56      Ravi          0
5   32      Amit          0
6   52  Sarvanan          0
7   34  Sarvanan          0
8   47      Ravi          1
9   35  Sarvanan          0

In [5]:
# Another way of writing column name
mydata2 = pd.DataFrame(mydata, columns=["Name", "Age", "Bike"])
mydata2

       Name  Age  Bike
0      Ravi   32     1
1  Sarvanan   23     1
2      Ravi   19     1
3  Sarvanan   46     1
4      Ravi   56     0
5      Amit   32     0
6  Sarvanan   52     0
7  Sarvanan   34     0
8      Ravi   47     1
9  Sarvanan   35     0

# Reading Data Sets From CSV files

# read csv files

In [6]:
my_df = pd.read_csv('SaveDF.csv')
my_df

   Unnamed: 0     Name Qualification Intelligence
0           0  Vinayak           B.E        Smart
1           1    Sarva           BSC     Laziness
2           2     Amit           BAF     Bakchodi
3           3     Ravi           B.E       Ra===i

In [7]:
my_df.head()   # first 5 obs, you can also mention rows

   Unnamed: 0     Name Qualification Intelligence
0           0  Vinayak           B.E        Smart
1           1    Sarva           BSC     Laziness
2           2     Amit           BAF     Bakchodi
3           3     Ravi           B.E       Ra===i

In [8]:
my_df.tail()  # Last 5 obs

   Unnamed: 0     Name Qualification Intelligence
0           0  Vinayak           B.E        Smart
1           1    Sarva           BSC     Laziness
2           2     Amit           BAF     Bakchodi
3           3     Ravi           B.E       Ra===i

In [9]:
my_df.shape

(4, 4)

In [10]:
my_df.columns

Index(['Unnamed: 0', 'Name', 'Qualification', 'Intelligence'], dtype='object')

In [11]:
my_df.columns[1]

'Name'

In [12]:
my_df.dtypes

Unnamed: 0        int64
Name             object
Qualification    object
Intelligence     object
dtype: object

In [13]:
# To drop column
my_df.drop('Unnamed: 0', axis=1)

      Name Qualification Intelligence
0  Vinayak           B.E        Smart
1    Sarva           BSC     Laziness
2     Amit           BAF     Bakchodi
3     Ravi           B.E       Ra===i

# Write CSV File

In [14]:
mydata1.to_csv(r'save.csv', index=False)